Repository: python/python-docs-sv
Catalog: library/string.templatelib.po
Languages: sv

source: :mod:`!string.templatelib` --- Support for template string literals
sv: :mod:`!string.templatelib` --- Stöd för mallsträngslitteraler

source: **Source code:** :source:`Lib/string/templatelib.py`
sv: **Källkod:** :source:`Lib/string/templatelib.py`

source: :ref:`Format strings <f-strings>`
sv: :ref:`Formatsträngar <f-strings>`

source: :ref:`Template string literal (t-string) syntax <t-strings>`
sv: :ref:`Syntax för mallsträngens bokstav (t-string) <t-strings>`

source: Template strings
sv: Mall för strängar

source: Template strings are a mechanism for custom string processing. They have the full flexibility of Python's :ref:`f-strings`, but return a :class:`Template` instance that gives access to the static and interpolated (in curly braces) parts of a string *before* they are combined.
sv: Template strings är en mekanism för anpassad strängbehandling. De har samma flexibilitet som Pythons :ref:`f-strings`, men returnerar en :class:`Template`\-instans som ger tillgång till de statiska och interpolerade (inom hakparenteser) delarna av en sträng *innan* de kombineras.

source: To write a t-string, use a ``'t'`` prefix instead of an ``'f'``, like so:
sv: För att skriva en t-sträng använder du ett ``'t'``-prefix istället för ett ``'f'``, så här:

source: Types
sv: Typer

source: The :class:`!Template` class describes the contents of a template string. It is immutable, meaning that attributes of a template cannot be reassigned.
sv: Klassen :class:`!Template` beskriver innehållet i en mallsträng. Den är oföränderlig, vilket innebär att attribut i en mall inte kan tilldelas på nytt.

source: The most common way to create a :class:`!Template` instance is to use the :ref:`template string literal syntax <t-strings>`. This syntax is identical to that of :ref:`f-strings <f-strings>`, except that it uses a ``t`` prefix in place of an ``f``:
sv: Det vanligaste sättet att skapa en :class:`!Template`\-instans är att använda :ref:`template string literal syntax <t-strings>`. Denna syntax är identisk med den för :ref:`f-strings <f-strings>`, förutom att den använder ett ``t``-prefix i stället för ett ``f``:

source: Templates are stored as sequences of literal :attr:`~Template.strings` and dynamic :attr:`~Template.interpolations`. A :attr:`~Template.values` attribute holds the values of the interpolations:
sv: Mallar lagras som sekvenser av bokstavliga :attr:`~Template.strings` och dynamiska :attr:`~Template.interpolations`. Ett attribut :attr:`~Template.values` innehåller värdena för interpoleringen:

source: The :attr:`!strings` tuple has one more element than :attr:`!interpolations` and :attr:`!values`; the interpolations “belong” between the strings. This may be easier to understand when tuples are aligned
sv: Tupeln :attr:`!strings` har ett element mer än :attr:`!interpolations` och :attr:`!values`; interpolationerna "hör hemma" mellan strängarna. Detta kan vara lättare att förstå när tuplerna är inriktade

source: Attributes
sv: Attribut

source: A :class:`tuple` of the static strings in the template.
sv: En :class:`tupel` av de statiska strängarna i mallen.

source: Empty strings *are* included in the tuple:
sv: Tomma strängar *inkluderas* i tupeln:

source: The ``strings`` tuple is never empty, and always contains one more string than the ``interpolations`` and ``values`` tuples:
sv: Tupeln ``strings`` är aldrig tom och innehåller alltid en sträng mer än tuplarna ``interpolations`` och ``values``:

source: A :class:`tuple` of the interpolations in the template.
sv: En :class:`tupel` av interpoleringarna i mallen.

source: The ``interpolations`` tuple may be empty and always contains one fewer values than the ``strings`` tuple:
sv: Tupeln ``interpolations`` kan vara tom och innehåller alltid ett värde mindre än tupeln ``strings``:

source: A tuple of all interpolated values in the template.
sv: En tupel av alla interpolerade värden i mallen.

source: The ``values`` tuple always has the same length as the ``interpolations`` tuple. It is always equivalent to ``tuple(i.value for i in template.interpolations)``.
sv: Tupeln ``values`` har alltid samma längd som tupeln ``interpolations``. Den är alltid ekvivalent med ``tuple(i.value for i in template.interpolations)``.

source: Methods
sv: Metoder

source: While literal syntax is the most common way to create a :class:`!Template`, it is also possible to create them directly using the constructor:
sv: Även om litteral syntax är det vanligaste sättet att skapa en :class:`!Template`, är det också möjligt att skapa dem direkt med hjälp av konstruktören:

source: If multiple strings are passed consecutively, they will be concatenated into a single value in the :attr:`~Template.strings` attribute. For example, the following code creates a :class:`Template` with a single final string:
sv: Om flera strängar skickas i följd kommer de att sammanfogas till ett enda värde i attributet :attr:`~Template.strings`. Följande kod skapar t.ex. en :class:`Template` med en enda slutsträng:

source: If multiple interpolations are passed consecutively, they will be treated as separate interpolations and an empty string will be inserted between them. For example, the following code creates a template with empty placeholders in the :attr:`~Template.strings` attribute:
sv: Om flera interpoleringar skickas i följd kommer de att behandlas som separata interpoleringar och en tom sträng kommer att infogas mellan dem. Följande kod skapar t.ex. en mall med tomma platshållare i attributet :attr:`~Template.strings`:

source: Iterate over the template, yielding each non-empty string and :class:`Interpolation` in the correct order:
sv: Iterera över mallen, vilket ger varje icke-tom sträng och :class:`Interpolation` i rätt ordning:

source: Empty strings are **not** included in the iteration:
sv: Tomma strängar ingår **inte** i iterationen:

source: Concatenate this template with another, returning a new :class:`!Template` instance:
sv: Sammanfoga denna mall med en annan och returnera en ny :class:`!Template`-instans:

source: Concatenating a :class:`!Template` and a ``str`` is **not** supported. This is because it is unclear whether the string should be treated as a static string or an interpolation. If you want to concatenate a :class:`!Template` with a string, you should either wrap the string directly in a :class:`!Template` (to treat it as a static string) or use an :class:`!Interpolation` (to treat it as dynamic):
sv: Att sammanfoga en :class:`!Template` och en ``str`` stöds **inte**. Detta beror på att det är oklart om strängen ska behandlas som en statisk sträng eller en interpolation. Om du vill konkatenera en :class:`!Template` med en sträng, bör du antingen linda in strängen direkt i en :class:`!Template` (för att behandla den som en statisk sträng) eller använda en :class:`!Interpolation` (för att behandla den som dynamisk):

source: The :class:`!Interpolation` type represents an expression inside a template string. It is immutable, meaning that attributes of an interpolation cannot be reassigned.
sv: Typen :class:`!Interpolation` representerar ett uttryck inuti en mallsträng. Den är oföränderlig, vilket innebär att attribut för en interpolation inte kan tilldelas på nytt.

source: Interpolations support pattern matching, allowing you to match against their attributes with the :ref:`match statement <match>`:
sv: Interpolationer stöder mönstermatchning, vilket gör att du kan matcha mot deras attribut med :ref:`match statement <match>`:

source: The evaluated value of the interpolation.
sv: Det utvärderade värdet för interpoleringen.

source: The text of a valid Python expression, or an empty string.
sv: Texten i ett giltigt Python-uttryck, eller en tom sträng.

source: The :attr:`.expression` is the original text of the interpolation's Python expression, if the interpolation was created from a t-string literal. Developers creating interpolations manually should either set this to an empty string or choose a suitable valid Python expression.
sv: :attr:`.expression` är originaltexten för interpolerings Python-uttryck, om interpoleringen skapades från en t-string-litteral. Utvecklare som skapar interpoleringen manuellt bör antingen sätta detta till en tom sträng eller välja ett lämpligt giltigt Python-uttryck.

source: The conversion to apply to the value, or ``None``.
sv: Den konvertering som ska tillämpas på värdet, eller ``None``.

source: The :attr:`!conversion` is the optional conversion to apply to the value:
sv: :attr:`!conversion` är den valfria konvertering som ska tillämpas på värdet:

source: Unlike f-strings, where conversions are applied automatically, the expected behavior with t-strings is that code that *processes* the :class:`!Template` will decide how to interpret and whether to apply the :attr:`!conversion`. For convenience, the :func:`convert` function can be used to mimic f-string conversion semantics.
sv: Till skillnad från f-strängar, där konverteringar tillämpas automatiskt, är det förväntade beteendet med t-strängar att kod som *behandlar* :class:`!Template` bestämmer hur den ska tolka och om den ska tillämpa :attr:`!conversion`. För enkelhetens skull kan funktionen :func:`convert` användas för att efterlikna semantiken för konvertering av f-strängar.

source: The format specification to apply to the value.
sv: Den formatspecifikation som ska tillämpas på värdet.

source: The :attr:`!format_spec` is an optional, arbitrary string used as the format specification to present the value:
sv: :attr:`!format_spec` är en valfri, godtycklig sträng som används som formatspecifikation för att presentera värdet:

source: Unlike f-strings, where format specifications are applied automatically via the :func:`format` protocol, the expected behavior with t-strings is that code that *processes* the interpolation will decide how to interpret and whether to apply the format specification. As a result, :attr:`!format_spec` values in interpolations can be arbitrary strings, including those that do not conform to the :func:`format` protocol.
sv: Till skillnad från f-strängar, där formatspecifikationer tillämpas automatiskt via protokollet :func:`format`, är det förväntade beteendet med t-strängar att koden som *bearbetar* interpoleringen bestämmer hur formatspecifikationen ska tolkas och om den ska tillämpas. Som ett resultat kan :attr:`!format_spec`\-värden i interpoleringar vara godtyckliga strängar, inklusive de som inte överensstämmer med :func:`format`\-protokollet.

source: Create a new :class:`!Interpolation` object from component parts.
sv: Skapa ett nytt :class:`!Interpolation`\-objekt av olika komponenter.

source: Parameters
sv: Parametrar

source: The evaluated, in-scope result of the interpolation.
sv: Det utvärderade resultatet av interpoleringen, inom räckvidden.

source: The :ref:`conversion <formatstrings>` to be used, one of ``None``, ``'a'``, ``'r'``, or ``'s'``.
sv: Den :ref:`konvertering <formatstrings>` som ska användas, en av ``None``, ``'a'``, ``'r'`` eller ``'s'``.

source: An optional, arbitrary string used as the :ref:`format specification <formatspec>` to present the value.
sv: En valfri, godtycklig sträng som används som :ref:`formatspecifikation <formatspec>` för att presentera värdet.

source: Helper functions
sv: Hjälpfunktioner

source: Applies formatted string literal :ref:`conversion <formatstrings-conversion>` semantics to the given object *obj*. This is frequently useful for custom template string processing logic.
sv: Tillämpar formaterad strängbokstäver :ref:`konvertering <formatstrings-conversion>` semantik på det givna objektet *obj*. Detta är ofta användbart för anpassad logik för bearbetning av mallsträngar.

source: Three conversion flags are currently supported:
sv: Tre konverteringsflaggor stöds för närvarande:

source: ``'s'`` which calls :func:`str` on the value (like ``!s``),
sv: ``'s'`` som anropar :func:`str` på värdet (som ``!s``),

source: ``'r'`` which calls :func:`repr` (like ``!r``), and
sv: ``'r'`` som anropar :func:`repr` (som ``!r``), och

source: ``'a'`` which calls :func:`ascii` (like ``!a``).
sv: ``'a'`` som anropar :func:`ascii` (som ``!a``).

source: If the conversion flag is ``None``, *obj* is returned unchanged.
sv: Om konverteringsflaggan är ``None`` returneras *obj* oförändrad.
