Repository: python/python-docs-sv
Catalog: howto/a-conceptual-overview-of-asyncio.po
Languages: sv

source: The coroutine is resumed via the ``coroutine.send(42)`` call on line 21. The coroutine picks back up from where it ``yield``\ ed (or paused) on line 3 and executes the remaining statements in its body. When a coroutine finishes, it raises a :exc:`StopIteration` exception with the return value attached in the :attr:`~StopIteration.value` attribute.
sv: Coroutinen återupptas via anropet ``coroutine.send(42)`` på rad 21. Coroutinen tar vid där den "gav upp" (eller pausade) på rad 3 och utför de återstående satserna i dess kropp. När en coroutine är klar utlöser den ett :exc:`StopIteration`-undantag med returvärdet i attributet :attr:`~StopIteration.value`.

source: That snippet produces this output:
sv: Det utdraget ger följande resultat:

source: Beginning coroutine main(). Awaiting rock... Coroutine paused and returned intermediate value: 7. Resuming coroutine and sending in value: 42. Rock.__await__ resuming with value: 42. Coroutine received value: 42 from rock. Coroutine main() finished and provided value: 23.
sv: Börjar coroutine main(). Väntar på rock... Coroutine pausade och returnerade mellanvärde: 7. Återupptar coroutine och skickar in värde: 42. Rock.__await__ återupptas med värde: 42. Coroutine mottog värde: 42 från rock. Coroutine main() avslutades och gav värde: 23.

source: It's worth pausing for a moment here and making sure you followed the various ways that control flow and values were passed. A lot of important ideas were covered and it's worth ensuring your understanding is firm.
sv: Det är värt att stanna upp ett ögonblick här och se till att du följde de olika sätten som kontrollflödet och värdena skickades. Många viktiga idéer täcktes och det är värt att se till att din förståelse är fast.

source: The only way to yield (or effectively cede control) from a coroutine is to ``await`` an object that ``yield``\ s in its ``__await__`` method. That might sound odd to you. You might be thinking:
sv: Det enda sättet att ge upp (eller effektivt överlåta kontrollen) från en coroutine är att ``await`` ett objekt som ``yield`` s i dess ``__await__`` metod. Det kanske låter konstigt för dig. Du kanske tänker:

source: 1. What about a ``yield`` directly within the coroutine function? The coroutine function becomes an :ref:`async generator function <asynchronous-generator-functions>`, a different beast entirely.
sv: 1. Vad sägs om en ``yield`` direkt inom coroutine-funktionen? Coroutine-funktionen blir en :ref:`async generatorfunktion <asynchronous-generator-functions>`, en helt annan best.

source: 2. What about a :ref:`yield from <yieldexpr>` within the coroutine function to a (plain) generator? That causes the error: ``SyntaxError: yield from not allowed in a coroutine.`` This was intentionally designed for the sake of simplicity -- mandating only one way of using coroutines. Initially ``yield`` was barred as well, but was re-accepted to allow for async generators. Despite that, ``yield from`` and ``await`` effectively do the same thing.
sv: 2. Hur är det med en :ref:`yield from <yieldexpr>` inom coroutine-funktionen till en (vanlig) generator? Det orsakar felet: ``SyntaxError: yield from not allowed in a coroutine.`` Detta var avsiktligt utformat för enkelhetens skull - att bara tillåta ett sätt att använda coroutines. Ursprungligen var ``yield`` också förbjudet, men accepterades igen för att möjliggöra asynkrona generatorer. Trots det gör ``yield from`` och ``await`` effektivt samma sak.

source: A :ref:`future <asyncio-future-obj>` is an object meant to represent a computation's status and result. The term is a nod to the idea of something still to come or not yet happened, and the object is a way to keep an eye on that something.
sv: En :ref:`future <asyncio-future-obj>` är ett objekt som är avsett att representera en beräknings status och resultat. Termen är en blinkning till idén om något som fortfarande ska komma eller ännu inte har hänt, och objektet är ett sätt att hålla ett öga på detta något.

source: A future has a few important attributes. One is its state which can be either "pending", "cancelled" or "done". Another is its result, which is set when the state transitions to done. Unlike a coroutine, a future does not represent the actual computation to be done; instead, it represents the status and result of that computation, kind of like a status light (red, yellow or green) or indicator.
sv: En framtid har några viktiga attribut. Ett är dess tillstånd som kan vara antingen "pending", "cancelled" eller "done". Ett annat är dess resultat, som sätts när tillståndet övergår till done. Till skillnad från en coroutine representerar en future inte den faktiska beräkningen som ska göras, utan istället statusen och resultatet av den beräkningen, ungefär som en statuslampa (röd, gul eller grön) eller indikator.

source: :class:`asyncio.Task` subclasses :class:`asyncio.Future` in order to gain these various capabilities. The prior section said tasks store a list of callbacks, which wasn't entirely accurate. It's actually the ``Future`` class that implements this logic, which ``Task`` inherits.
sv: :class:`asyncio.Task` subklassar :class:`asyncio.Future` för att få dessa olika möjligheter. I föregående avsnitt sades att uppgifter lagrar en lista över återanrop, vilket inte var helt korrekt. Det är faktiskt klassen ``Future`` som implementerar den här logiken, som ``Task`` ärver.

source: Futures may also be used directly (not via tasks). Tasks mark themselves as done when their coroutine is complete. Futures are much more versatile and will be marked as done when you say so. In this way, they're the flexible interface for you to make your own conditions for waiting and resuming.
sv: Futures kan också användas direkt (inte via tasks). Tasks markerar sig själva som färdiga när deras coroutine är klar. Futures är mycket mer mångsidiga och markeras som klara när du säger till. På så sätt är de ett flexibelt gränssnitt där du kan skapa dina egna villkor för väntan och återupptagning.

source: A homemade asyncio.sleep
sv: En hemmagjord asyncio.sleep

source: We'll go through an example of how you could leverage a future to create your own variant of asynchronous sleep (``async_sleep``) which mimics :func:`asyncio.sleep`.
sv: Vi ska gå igenom ett exempel på hur du kan utnyttja en framtid för att skapa din egen variant av asynkron sömn (``async_sleep``) som efterliknar :func:`asyncio.sleep`.

source: This snippet registers a few tasks with the event loop and then awaits a coroutine wrapped in a task: ``async_sleep(3)``. We want that task to finish only after three seconds have elapsed, but without preventing other tasks from running.
sv: Detta utdrag registrerar några uppgifter med händelseslingan och väntar sedan på en coroutine som är insvept i en uppgift: ``async_sleep(3)``. Vi vill att den uppgiften ska avslutas först efter att tre sekunder har gått, men utan att hindra andra uppgifter från att köras.

source: Below, we use a future to enable custom control over when that task will be marked as done. If :meth:`future.set_result() <asyncio.Future.set_result>` (the method responsible for marking that future as done) is never called, then this task will never finish. We've also enlisted the help of another task, which we'll see in a moment, that will monitor how much time has elapsed and, accordingly, call ``future.set_result()``.
sv: Nedan använder vi en future för att möjliggöra anpassad kontroll över när den uppgiften ska markeras som klar. Om :meth:`future.set_result() <asyncio.Future.set_result>` (metoden som ansvarar för att markera den framtiden som klar) aldrig anropas, kommer den här uppgiften aldrig att avslutas. Vi har också tagit hjälp av en annan uppgift, som vi kommer att se om en stund, som kommer att övervaka hur mycket tid som har gått och följaktligen anropa ``future.set_result()``.

source: Below, we'll use a rather bare object, ``YieldToEventLoop()``, to ``yield`` from ``__await__`` in order to cede control to the event loop. This is effectively the same as calling ``asyncio.sleep(0)``, but this approach offers more clarity, not to mention it's somewhat cheating to use ``asyncio.sleep`` when showcasing how to implement it!
sv: Nedan kommer vi att använda ett ganska naket objekt, ``YieldToEventLoop()``, för att ``yield`` från ``__await__`` för att överlåta kontrollen till händelseslingan. Detta är effektivt detsamma som att ringa ``asyncio.sleep(0)``, men detta tillvägagångssätt ger mer tydlighet, för att inte tala om att det är något fusk att använda ``asyncio.sleep`` när man visar hur man implementerar det!

source: As usual, the event loop cycles through its tasks, giving them control and receiving control back when they pause or finish. The ``watcher_task``, which runs the coroutine ``_sleep_watcher(...)``, will be invoked once per full cycle of the event loop. On each resumption, it'll check the time and if not enough has elapsed, then it'll pause once again and hand control back to the event loop. Eventually, enough time will have elapsed, and ``_sleep_watcher(...)`` will mark the future as done, and then itself finish too by breaking out of the infinite ``while`` loop. Given this helper task is only invoked once per cycle of the event loop, you'd be correct to note that this asynchronous sleep will sleep *at least* three seconds, rather than exactly three seconds. Note this is also of true of ``asyncio.sleep``.
sv: Som vanligt cyklar händelseslingan genom sina uppgifter, ger dem kontroll och får tillbaka kontrollen när de pausar eller avslutas. Uppgiften ``watcher_task``, som kör coroutinen ``_sleep_watcher(...)``, kommer att anropas en gång per hel cykel av händelseslingan. Vid varje återupptagande kommer den att kontrollera tiden och om inte tillräckligt mycket tid har gått, kommer den att pausa igen och lämna tillbaka kontrollen till händelseslingan. Så småningom kommer tillräckligt med tid att ha gått och ``_sleep_watcher(...)`` kommer att markera framtiden som klar och sedan själv också avsluta genom att bryta sig ur den oändliga ``while``-slingan. Med tanke på att denna hjälpuppgift bara anropas en gång per cykel av händelseslingan, skulle du ha rätt att notera att denna asynkrona sömn kommer att sova *minst* tre sekunder, snarare än exakt tre sekunder. Observera att detta också gäller för ``asyncio.sleep``.

source: Here is the full program's output:
sv: Här är programmets fullständiga utdata:

source: You might feel this implementation of asynchronous sleep was unnecessarily convoluted. And, well, it was. The example was meant to showcase the versatility of futures with a simple example that could be mimicked for more complex needs. For reference, you could implement it without futures, like so::
sv: Du kanske tycker att denna implementering av asynkron sömn var onödigt komplicerad. Och det var den också. Exemplet var avsett att visa mångsidigheten hos futures med ett enkelt exempel som kan efterliknas för mer komplexa behov. Som referens kan du implementera det utan futures, så här::

source: But, that's all for now. Hopefully you're ready to more confidently dive into some async programming or check out advanced topics in the :mod:`rest of the documentation <asyncio>`.
sv: Men det är allt för nu. Förhoppningsvis är du redo att med större självförtroende dyka in i asynkron programmering eller kolla in avancerade ämnen i :mod:`resten av dokumentationen <asyncio>`.
