Repository: python/python-docs-sv
Catalog: howto/a-conceptual-overview-of-asyncio.po
Languages: sv

source: A Conceptual Overview of :mod:`!asyncio`
sv: En konceptuell översikt av :mod:`!asyncio`

source: This :ref:`HOWTO <how-tos>` article seeks to help you build a sturdy mental model of how :mod:`asyncio` fundamentally works, helping you understand the how and why behind the recommended patterns.
sv: Den här artikeln :ref:`HOWTO <how-tos>` syftar till att hjälpa dig att bygga en stabil mental modell av hur :mod:`asyncio` i grunden fungerar, och hjälper dig att förstå hur och varför bakom de rekommenderade mönstren.

source: You might be curious about some key :mod:`!asyncio` concepts. You'll be comfortably able to answer these questions by the end of this article:
sv: Du kanske är nyfiken på några viktiga :mod:`!asyncio`-koncept. Du kommer att kunna svara på dessa frågor i slutet av den här artikeln:

source: What's happening behind the scenes when an object is awaited?
sv: Vad händer bakom kulisserna när ett objekt är väntat?

source: How does :mod:`!asyncio` differentiate between a task which doesn't need CPU-time (such as a network request or file read) as opposed to a task that does (such as computing n-factorial)?
sv: Hur skiljer :mod:`!asyncio` mellan en uppgift som inte behöver CPU-tid (t.ex. en nätverksförfrågan eller filläsning) och en uppgift som behöver CPU-tid (t.ex. beräkning av n-faktoriell)?

source: How to write an asynchronous variant of an operation, such as an async sleep or database request.
sv: Hur man skriver en asynkron variant av en operation, t.ex. en asynkron sömn eller databasförfrågan.

source: The `guide <https://github.com/anordin95/a-conceptual-overview-of-asyncio/ tree/main>`_ that inspired this HOWTO article, by Alexander Nordin.
sv: Guiden <https://github.com/anordin95/a-conceptual-overview-of-asyncio/ tree/main>`_ som inspirerade till den här HOWTO-artikeln, av Alexander Nordin.

source: This in-depth `YouTube tutorial series <https://www.youtube.com/ watch?v=Xbl7XjFYsN4&list=PLhNSoGM2ik6SIkVGXWBwerucXjgP1rHmB>`_ on ``asyncio`` created by Python core team member, Łukasz Langa.
sv: Denna djupgående `YouTube tutorial-serie <https://www.youtube.com/ watch?v=Xbl7XjFYsN4&list=PLhNSoGM2ik6SIkVGXWBwerucXjgP1rHmB>`_ om ``asyncio`` skapad av Python core team-medlem, Łukasz Langa.

source: `500 Lines or Less: A Web Crawler With asyncio Coroutines <https:// aosabook.org/en/500L/a-web-crawler-with-asyncio-coroutines.html>`_ by A. Jesse Jiryu Davis and Guido van Rossum.
sv: `500 rader eller mindre: A Web Crawler With asyncio Coroutines <https:// aosabook.org/en/500L/a-web-crawler-with-asyncio-coroutines.html>`_ av A. Jesse Jiryu Davis och Guido van Rossum.

source: A conceptual overview part 1: the high-level
sv: En konceptuell översikt del 1: den höga nivån

source: In part 1, we'll cover the main, high-level building blocks of :mod:`!asyncio`: the event loop, coroutine functions, coroutine objects, tasks and ``await``.
sv: I del 1 går vi igenom de viktigaste byggstenarna på hög nivå i :mod:`!asyncio`: händelseslingan, coroutine-funktioner, coroutine-objekt, tasks och ``await``.

source: Event Loop
sv: Händelseslinga

source: Everything in :mod:`!asyncio` happens relative to the event loop. It's the star of the show. It's like an orchestra conductor. It's behind the scenes managing resources. Some power is explicitly granted to it, but a lot of its ability to get things done comes from the respect and cooperation of its worker bees.
sv: Allt i :mod:`!asyncio` sker i förhållande till händelseslingan. Den är stjärnan i showen. Den är som en orkesterdirigent. Den är bakom kulisserna och hanterar resurser. Viss makt ges uttryckligen till den, men mycket av dess förmåga att få saker gjorda kommer från respekt och samarbete från dess arbetsbin.

source: In more technical terms, the event loop contains a collection of jobs to be run. Some jobs are added directly by you, and some indirectly by :mod:`!asyncio`. The event loop takes a job from its backlog of work and invokes it (or "gives it control"), similar to calling a function, and then that job runs. Once it pauses or completes, it returns control to the event loop. The event loop will then select another job from its pool and invoke it. You can *roughly* think of the collection of jobs as a queue: jobs are added and then processed one at a time, generally (but not always) in order. This process repeats indefinitely with the event loop cycling endlessly onwards. If there are no more jobs pending execution, the event loop is smart enough to rest and avoid needlessly wasting CPU cycles, and will come back when there's more work to be done.
sv: I mer tekniska termer innehåller händelseslingan en samling jobb som ska köras. Vissa jobb läggs till direkt av dig och andra indirekt av :mod:`!asyncio`. Händelseslingan tar ett jobb från sin backlog av arbete och anropar det (eller "ger det kontroll"), liknande att anropa en funktion, och sedan körs det jobbet. När det pausas eller slutförs återgår kontrollen till händelseslingan. Händelseslingan väljer sedan ett annat jobb från sin pool och anropar det. Du kan *genomgående* tänka på samlingen av jobb som en kö: jobb läggs till och bearbetas sedan ett i taget, i allmänhet (men inte alltid) i ordning. Denna process upprepas på obestämd tid och händelseslingan fortsätter i all oändlighet. Om det inte finns fler jobb som väntar på att utföras är händelseslingan tillräckligt smart för att vila och undvika att slösa CPU-cykler i onödan, och kommer tillbaka när det finns mer arbete att göra.

source: Effective execution relies on jobs sharing well and cooperating; a greedy job could hog control and leave the other jobs to starve, rendering the overall event loop approach rather useless.
sv: Ett effektivt utförande bygger på att jobben delar med sig väl och samarbetar; ett girigt jobb kan ta kontrollen och låta de andra jobben svälta, vilket gör den övergripande händelseslingan ganska värdelös.

source: Asynchronous functions and coroutines
sv: Asynkrona funktioner och coroutines

source: This is a basic, boring Python function::
sv: Detta är en grundläggande, tråkig Python-funktion::

source: Calling a regular function invokes its logic or body::
sv: När du anropar en vanlig funktion anropas dess logik eller kropp::

source: >>> hello_printer() Hi, I am a lowly, simple printer, though I have all I need in life -- fresh paper and my dearly beloved octopus partner in crime.
sv: >>> hello_printer() Hej, jag är en liten, enkel skrivare, även om jag har allt jag behöver i livet - färskt papper och min kära älskade bläckfisk som medbrottsling.

source: The :ref:`async def <async def>`, as opposed to just a plain ``def``, makes this an asynchronous function (or "coroutine function"). Calling it creates and returns a :ref:`coroutine <coroutine>` object.
sv: :ref:`async def <async def>`, i motsats till bara en vanlig ``def``, gör detta till en asynkron funktion (eller "coroutine-funktion"). När den anropas skapas och returneras ett :ref:`coroutine <coroutine>`\ -objekt.

source: Calling the async function, ``loudmouth_penguin``, does not execute the print statement; instead, it creates a coroutine object::
sv: När async-funktionen ``loudmouth_penguin`` anropas utförs inte utskriftssatsen, utan i stället skapas ett coroutine-objekt::

source: The terms "coroutine function" and "coroutine object" are often conflated as coroutine. That can be confusing! In this article, coroutine specifically refers to a coroutine object, or more precisely, an instance of :data:`types.CoroutineType` (native coroutine). Note that coroutines can also exist as instances of :class:`collections.abc.Coroutine` -- a distinction that matters for type checking.
sv: Termerna "coroutine-funktion" och "coroutine-objekt" sammanfattas ofta som coroutine. Det kan vara förvirrande! I den här artikeln hänvisar coroutine specifikt till ett coroutine-objekt, eller mer exakt, en instans av :data:`types.CoroutineType` (native coroutine). Observera att coroutines också kan existera som instanser av :class:`collections.abc.Coroutine` -- en distinktion som är viktig för typkontroll.

source: A coroutine represents the function's body or logic. A coroutine has to be explicitly started; again, merely creating the coroutine does not start it. Notably, the coroutine can be paused and resumed at various points within the function's body. That pausing and resuming ability is what allows for asynchronous behavior!
sv: En coroutine representerar funktionens kropp eller logik. En coroutine måste startas explicit; det räcker inte med att skapa en coroutine för att starta den. Coroutinen kan pausas och återupptas vid olika punkter inom funktionens kropp. Denna förmåga att pausa och återuppta är det som möjliggör asynkront beteende!

source: Coroutines and coroutine functions were built by leveraging the functionality of :term:`generators <generator iterator>` and :term:`generator functions <generator>`. Recall, a generator function is a function that :keyword:`yield`\s, like this one::
sv: Coroutines och coroutine-funktioner byggdes genom att utnyttja funktionaliteten i :term:`generators <generator iterator>` och :term:`generator functions <generator>`. Kom ihåg att en generatorfunktion är en funktion som :keyword:`yield`\s, som den här::

source: Similar to a coroutine function, calling a generator function does not run it. Instead, it creates a generator object::
sv: I likhet med en coroutine-funktion körs inte en generatorfunktion när den anropas. Istället skapas ett generatorobjekt::

source: You can proceed to the next ``yield`` of a generator by using the built-in function :func:`next`. In other words, the generator runs, then pauses. For example::
sv: Du kan gå vidare till nästa ``yield`` i en generator genom att använda den inbyggda funktionen :func:`next`. Med andra ord, generatorn körs och pausas sedan. Till exempel::

source: >>> generator = get_random_number() >>> next(generator) Hi 1 >>> next(generator) Hello 7
sv: >>> generator = get_random_number() >>> next(generator) Hej 1 >>> next(generator) Hallå 7

source: Roughly speaking, :ref:`tasks <asyncio-task-obj>` are coroutines (not coroutine functions) tied to an event loop. A task also maintains a list of callback functions whose importance will become clear in a moment when we discuss :keyword:`await`. The recommended way to create tasks is via :func:`asyncio.create_task`.
sv: Grovt sett är :ref:`tasks <asyncio-task-obj>` coroutines (inte coroutine-funktioner) knutna till en händelseslinga. En task upprätthåller också en lista över callback-funktioner vars betydelse kommer att framgå när vi diskuterar :keyword:`await`. Det rekommenderade sättet att skapa uppgifter är via :func:`asyncio.create_task`.

source: Creating a task automatically schedules it for execution (by adding a callback to run it in the event loop's to-do list, that is, collection of jobs).
sv: När du skapar en uppgift schemaläggs den automatiskt för utförande (genom att lägga till ett callback för att köra den i händelseslingans att göra-lista, dvs. en samling jobb).

source: Since there's only one event loop (in each thread), :mod:`!asyncio` takes care of associating the task with the event loop for you. As such, there's no need to specify the event loop.
sv: Eftersom det bara finns en händelseslinga (i varje tråd) tar :mod:`!asyncio` hand om att associera uppgiften med händelseslingan åt dig. Därför finns det inget behov av att specificera händelseslingan.

source: Earlier, we manually created the event loop and set it to run forever. In practice, it's recommended to use (and common to see) :func:`asyncio.run`, which takes care of managing the event loop and ensuring the provided coroutine finishes before advancing. For example, many async programs follow this setup::
sv: Tidigare skapade vi händelseslingan manuellt och ställde in den på att köras för evigt. I praktiken är det rekommenderat att använda (och vanligt att se) :func:`asyncio.run`, som tar hand om hanteringen av händelseslingan och ser till att den medföljande coroutinen avslutas innan den går vidare. Till exempel följer många asynkrona program den här inställningen::

source: It's important to be aware that the task itself is not added to the event loop, only a callback to the task is. This matters if the task object you created is garbage collected before it's called by the event loop. For example, consider this program:
sv: Det är viktigt att vara medveten om att själva uppgiften inte läggs till i händelseslingan, utan endast en återuppringning till uppgiften. Detta har betydelse om det uppgiftsobjekt du skapade samlas in innan det anropas av händelseslingan. Tänk till exempel på det här programmet:

source: Because there's no reference to the task object created on line 5, it *might* be garbage collected before the event loop invokes it. Later instructions in the coroutine ``main()`` hand control back to the event loop so it can invoke other jobs. When the event loop eventually tries to run the task, it might fail and discover the task object does not exist! This can also happen even if a coroutine keeps a reference to a task but completes before that task finishes. When the coroutine exits, local variables go out of scope and may be subject to garbage collection. In practice, ``asyncio`` and Python's garbage collector work pretty hard to ensure this sort of thing doesn't happen. But that's no reason to be reckless!
sv: Eftersom det inte finns någon referens till det uppgiftsobjekt som skapades på rad 5, kan det *möjligen* rensas bort innan händelseslingan anropar det. Senare instruktioner i korutinen ``main()`` återlämnar kontrollen till händelseslingan så att den kan anropa andra jobb. När händelseslingan så småningom försöker köra uppgiften kan det misslyckas och upptäcka att uppgiftsobjektet inte finns! Detta kan också hända även om en korutin behåller en referens till en uppgift men slutförs innan uppgiften är klar. När korutinen avslutas går lokala variabler ut ur scope och kan bli föremål för skräpinsamling. I praktiken arbetar ``asyncio`` och Pythons skräpinsamlare hårt för att se till att sådant inte händer. Men det är ingen anledning att vara vårdslös!

source: :keyword:`await` is a Python keyword that's commonly used in one of two different ways::
sv: :keyword:`await` är ett nyckelord i Python som vanligtvis används på två olika sätt::

source: In a crucial way, the behavior of ``await`` depends on the type of object being awaited.
sv: På ett avgörande sätt beror beteendet hos ``await`` på vilken typ av objekt som väntas.

source: Awaiting a task will cede control from the current task or coroutine to the event loop. In the process of relinquishing control, a few important things happen. We'll use the following code example to illustrate::
sv: Att invänta en uppgift innebär att kontrollen överförs från den aktuella uppgiften eller coroutinen till händelseslingan. I samband med att kontrollen överlåts händer några viktiga saker. Vi kommer att använda följande kodexempel för att illustrera::

source: In this example, imagine the event loop has passed control to the start of the coroutine ``plant_a_tree()``. As seen above, the coroutine creates a task and then awaits it. The ``await dig_the_hole_task`` instruction adds a callback (which will resume ``plant_a_tree()``) to the ``dig_the_hole_task`` object's list of callbacks. And then, the instruction cedes control to the event loop. Some time later, the event loop will pass control to ``dig_the_hole_task`` and the task will finish whatever it needs to do. Once the task finishes, it will add its various callbacks to the event loop, in this case, a call to resume ``plant_a_tree()``.
sv: I det här exemplet föreställer vi oss att händelseslingan har överfört kontrollen till starten av coroutinen ``plant_a_tree()``. Som vi såg ovan skapar coroutinen en uppgift och väntar sedan på den. Instruktionen ``await dig_the_hole_task`` lägger till en återuppringning (som kommer att återuppta ``plant_a_tree()``) till objektet ``dig_the_hole_task`` lista över återuppringningar. Och sedan lämnar instruktionen över kontrollen till händelseslingan. En tid senare kommer händelseslingan att överföra kontrollen till ``dig_the_hole_task`` och uppgiften kommer att avsluta vad den behöver göra. När uppgiften är klar kommer den att lägga till sina olika återuppringningar till händelseslingan, i det här fallet ett anrop för att återuppta ``plant_a_tree()``.

source: Generally speaking, when the awaited task finishes (``dig_the_hole_task``), the original task or coroutine (``plant_a_tree()``) is added back to the event loops to-do list to be resumed.
sv: Generellt sett gäller att när den väntade uppgiften är klar (``gräva_hålet_uppgiften``) läggs den ursprungliga uppgiften eller coroutinen (``plantera_ett_träd()``) tillbaka till händelseslingans att-göra-lista för att återupptas.

source: This is a basic, yet reliable mental model. In practice, the control handoffs are slightly more complex, but not by much. In part 2, we'll walk through the details that make this possible.
sv: Detta är en grundläggande men ändå tillförlitlig mental modell. I praktiken är kontrollöverlämningarna något mer komplexa, men inte mycket. I del 2 går vi igenom de detaljer som gör detta möjligt.

source: **Unlike tasks, awaiting a coroutine does not hand control back to the event loop!** Wrapping a coroutine in a task first, then awaiting that would cede control. The behavior of ``await coroutine`` is effectively the same as invoking a regular, synchronous Python function. Consider this program::
sv: **Till skillnad från uppgifter ger inte väntan på en coroutine tillbaka kontrollen till händelseslingan!** Att först paketera in en coroutine i en uppgift och sedan vänta på den skulle innebära att kontrollen övergår. Beteendet för ``await coroutine`` är i praktiken detsamma som att anropa en vanlig, synkron Python-funktion. Tänk på detta program::

source: The first statement in the coroutine ``main()`` creates ``task_b`` and schedules it for execution via the event loop. Then, ``coro_a()`` is repeatedly awaited. Control never cedes to the event loop which is why we see the output of all three ``coro_a()`` invocations before ``coro_b()``'s output:
sv: Den första satsen i coroutinen ``main()`` skapar ``task_b`` och schemalägger den för utförande via händelseslingan. Sedan inväntas ``coro_a()`` upprepade gånger. Kontrollen överförs aldrig till händelseslingan, vilket är anledningen till att vi ser utdata från alla tre ``coro_a()``-uppmaningarna före ``coro_b()``:s utdata:

source: If we change ``await coro_a()`` to ``await asyncio.create_task(coro_a())``, the behavior changes. The coroutine ``main()`` cedes control to the event loop with that statement. The event loop then proceeds through its backlog of work, calling ``task_b`` and then the task which wraps ``coro_a()`` before resuming the coroutine ``main()``.
sv: Om vi ändrar ``await coro_a()`` till ``await asyncio.create_task(coro_a())`` ändras beteendet. Coroutinen ``main()`` överlämnar kontrollen till händelseslingan med detta uttalande. Händelseslingan fortsätter sedan genom sitt eftersläpande arbete, anropar ``task_b`` och sedan den uppgift som omsluter ``coro_a()`` innan den återupptar coroutinen ``main()``.

source: This behavior of ``await coroutine`` can trip a lot of people up! That example highlights how using only ``await coroutine`` could unintentionally hog control from other tasks and effectively stall the event loop. :func:`asyncio.run` can help you detect such occurences via the ``debug=True`` flag which accordingly enables :ref:`debug mode <asyncio-debug-mode>`. Among other things, it will log any coroutines that monopolize execution for 100ms or longer.
sv: Detta beteende hos ``await coroutine`` kan göra många människor förvirrade! Det exemplet belyser hur användning av endast ``await coroutine`` oavsiktligt kan ta kontroll från andra uppgifter och effektivt stoppa händelseslingan. :func:`asyncio.run` kan hjälpa dig att upptäcka sådana händelser via flaggan ``debug=True`` som följaktligen aktiverar :ref:`debug mode <asyncio-debug-mode>`. Bland annat loggas alla coroutines som monopoliserar exekveringen i 100 ms eller längre.

source: The design intentionally trades off some conceptual clarity around usage of ``await`` for improved performance. Each time a task is awaited, control needs to be passed all the way up the call stack to the event loop. That might sound minor, but in a large program with many ``await``'s and a deep callstack that overhead can add up to a meaningful performance drag.
sv: Konstruktionen innebär att viss konceptuell klarhet kring användningen av ``await`` avsiktligt byts ut mot förbättrad prestanda. Varje gång en uppgift väntar måste kontrollen skickas hela vägen upp i anropsstacken till händelseslingan. Det kanske låter obetydligt, men i ett stort program med många ``await`` och en djup anropsstack kan detta leda till en meningsfull prestandaförlust.

source: A conceptual overview part 2: the nuts and bolts
sv: En konceptuell översikt del 2: skruvar och muttrar

source: Part 2 goes into detail on the mechanisms :mod:`!asyncio` uses to manage control flow. This is where the magic happens. You'll come away from this section knowing what ``await`` does behind the scenes and how to make your own asynchronous operators.
sv: Del 2 går in i detalj på de mekanismer som :mod:`!asyncio` använder för att hantera kontrollflödet. Det är här det magiska händer. Du kommer från detta avsnitt att veta vad ``await`` gör bakom kulisserna och hur du skapar dina egna asynkrona operatörer.

source: The inner workings of coroutines
sv: Det inre arbetet med coroutines

source: :mod:`!asyncio` leverages four components to pass around control.
sv: :mod:`!asyncio` utnyttjar fyra komponenter för att skicka runt kontrollen.

source: :meth:`coroutine.send(arg) <generator.send>` is the method used to start or resume a coroutine. If the coroutine was paused and is now being resumed, the argument ``arg`` will be sent in as the return value of the ``yield`` statement which originally paused it. If the coroutine is being used for the first time (as opposed to being resumed) ``arg`` must be ``None``.
sv: :meth:`coroutine.send(arg) <generator.send>` är den metod som används för att starta eller återuppta en coroutine. Om coroutinen pausades och nu återupptas, kommer argumentet ``arg`` att skickas in som returvärdet för ``yield``\ -satsen som ursprungligen pausade den. Om coroutinen används för första gången (i motsats till att återupptas) måste ``arg`` vara ``None``.

source: :ref:`yield <yieldexpr>`, like usual, pauses execution and returns control to the caller. In the example above, the ``yield``, on line 3, is called by ``... = await rock`` on line 11. More broadly speaking, ``await`` calls the :meth:`~object.__await__` method of the given object. ``await`` also does one more very special thing: it propagates (or "passes along") any ``yield``\ s it receives up the call-chain. In this case, that's back to ``... = coroutine.send(None)`` on line 16.
sv: :ref:`yield <yieldexpr>`, som vanligt, pausar exekveringen och återlämnar kontrollen till den som anropar. I exemplet ovan anropas ``yield`` på rad 3 av ``... = await rock`` på rad 11. Mer allmänt anropar ``await`` metoden :meth:`~object.__await__` för det givna objektet. ``await`` gör också en annan mycket speciell sak: den sprider (eller "skickar vidare") alla ``yield`` som den får upp i anropskedjan. I det här fallet är det tillbaka till ``... = coroutine.send(None)`` på rad 16.
